## Staging: sns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                        |
|--------|---------------------------------------------------|
| add    | `module.sns_problem_topic.aws_kms_key.sns_key[0]` |
|        | `module.sns_problem_topic.aws_sns_topic.this`     |
|        | `module.sns_toptask_topic.aws_kms_key.sns_key[0]` |
|        | `module.sns_toptask_topic.aws_sns_topic.this`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sns_problem_topic.aws_kms_key.sns_key[0] will be created
  + resource "aws_kms_key" "sns_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS Key for feedback-collection-api-problem-topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "992382783569"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt*",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "AWS:SourceArn" = "992382783569"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ses.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # module.sns_problem_topic.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "feedback-collection-api-problem-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # module.sns_toptask_topic.aws_kms_key.sns_key[0] will be created
  + resource "aws_kms_key" "sns_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS Key for feedback-collection-api-toptask-topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "992382783569"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt*",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "AWS:SourceArn" = "992382783569"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ses.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # module.sns_toptask_topic.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "feedback-collection-api-toptask-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + problem_topic_arn  = (known after apply)
  + problem_topic_name = (known after apply)
  + toptask_topic_arn  = (known after apply)
  + toptask_topic_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sns_problem_topic.aws_kms_key.sns_key[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.sns_toptask_topic.aws_kms_key.sns_key[0]"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
